SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32G0020/MM32G0020_Bootloader/Device/MM32G0020/Include/reg_tim.h
/**
  * @brief TIM_RCR Register Bit Definition
  */
#define  TIM_RCR_REP_Pos                          (0)
#define  TIM_RCR_REP_Msk                          (0xFFU << TIM_RCR_REP_Pos)                        /*!<Repeat counter value*/
#define  TIM_RCR_REP                              TIM_RCR_REP_Msk
#define  TIM_RCR_REP_0                            (0x01U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_1                            (0x02U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_2                            (0x04U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_3                            (0x08U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_4                            (0x10U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_5                            (0x20U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_6                            (0x40U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_7                            (0x80U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_CNT_Pos                      (8)
#define  TIM_RCR_REP_CNT_Msk                      (0xFFU << TIM_RCR_REP_CNT_Pos)                    /*!<Real-time value written by the repeat counter*/
#define  TIM_RCR_REP_CNT                          TIM_RCR_REP_CNT_Msk
#define  TIM_RCR_REP_CNT_0                        (0x01U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_1                        (0x02U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_2                        (0x04U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_3                        (0x08U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_4                        (0x10U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_5                        (0x20U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_6                        (0x40U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_7                        (0x80U << TIM_RCR_REP_CNT_Pos) 

/**
  * @brief TIM_CCR1 Register Bit Definition
  */
#define  TIM_CCR1_CCR1_Pos                        (0)
#define  TIM_CCR1_CCR1_Msk                        (0xFFFFU << TIM_CCR1_CCR1_Pos)                    /*!<Channel 1 capture/compare value*/
#define  TIM_CCR1_CCR1                            TIM_CCR1_CCR1_Msk
#define  TIM_CCR1_CCR1_0                          (0x0001U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_1                          (0x0002U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_2                          (0x0004U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_3                          (0x0008U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_4                          (0x0010U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_5                          (0x0020U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_6                          (0x0040U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_7                          (0x0080U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_8                          (0x0100U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_9                          (0x0200U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_10                         (0x0400U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_11                         (0x0800U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_12                         (0x1000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_13                         (0x2000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_14                         (0x4000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_15                         (0x8000U << TIM_CCR1_CCR1_Pos) 

/**
  * @brief TIM_CCR2 Register Bit Definition
  */
#define  TIM_CCR2_CCR2_Pos                        (0)
#define  TIM_CCR2_CCR2_Msk                        (0xFFFFU << TIM_CCR2_CCR2_Pos)                    /*!<Channel 2 capture/compare value*/
#define  TIM_CCR2_CCR2                            TIM_CCR2_CCR2_Msk
#define  TIM_CCR2_CCR2_0                          (0x0001U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_1                          (0x0002U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_2                          (0x0004U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_3                          (0x0008U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_4                          (0x0010U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_5                          (0x0020U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_6                          (0x0040U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_7                          (0x0080U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_8                          (0x0100U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_9                          (0x0200U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_10                         (0x0400U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_11                         (0x0800U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_12                         (0x1000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_13                         (0x2000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_14                         (0x4000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_15                         (0x8000U << TIM_CCR2_CCR2_Pos) 

/**
  * @brief TIM_CCR3 Register Bit Definition
  */
#define  TIM_CCR3_CCR3_Pos                        (0)
#define  TIM_CCR3_CCR3_Msk                        (0xFFFFU << TIM_CCR3_CCR3_Pos)                    /*!<Channel 3 capture/compare value*/
#define  TIM_CCR3_CCR3                            TIM_CCR3_CCR3_Msk
#define  TIM_CCR3_CCR3_0                          (0x0001U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_1                          (0x0002U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_2                          (0x0004U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_3                          (0x0008U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_4                          (0x0010U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_5                          (0x0020U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_6                          (0x0040U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_7                          (0x0080U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_8                          (0x0100U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_9                          (0x0200U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_10                         (0x0400U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_11                         (0x0800U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_12                         (0x1000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_13                         (0x2000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_14                         (0x4000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_15                         (0x8000U << TIM_CCR3_CCR3_Pos) 

/**
  * @brief TIM_CCR4 Register Bit Definition
  */
#define  TIM_CCR4_CCR4_Pos                        (0)
#define  TIM_CCR4_CCR4_Msk                        (0xFFFFU << TIM_CCR4_CCR4_Pos)                    /*!<Channel 4 capture/compare value*/
#define  TIM_CCR4_CCR4                            TIM_CCR4_CCR4_Msk
#define  TIM_CCR4_CCR4_0                          (0x0001U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_1                          (0x0002U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_2                          (0x0004U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_3                          (0x0008U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_4                          (0x0010U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_5                          (0x0020U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_6                          (0x0040U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_7                          (0x0080U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_8                          (0x0100U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_9                          (0x0200U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_10                         (0x0400U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_11                         (0x0800U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_12                         (0x1000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_13                         (0x2000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_14                         (0x4000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_15                         (0x8000U << TIM_CCR4_CCR4_Pos) 

/**
  * @brief TIM_BDTR Register Bit Definition
  */
#define  TIM_BDTR_DTG_Pos                         (0)
#define  TIM_BDTR_DTG_Msk                         (0xFFU << TIM_BDTR_DTG_Pos)                       /*!<Dead-time generator setup adjustment*/
#define  TIM_BDTR_DTG                             TIM_BDTR_DTG_Msk
#define  TIM_BDTR_DTG_0                           (0x01U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_1                           (0x02U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_2                           (0x04U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_3                           (0x08U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_4                           (0x10U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_5                           (0x20U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_6                           (0x40U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_7                           (0x80U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_LOCK_Pos                        (8)
#define  TIM_BDTR_LOCK_Msk                        (0x3U << TIM_BDTR_LOCK_Pos)                       /*!<Lock configuration*/
#define  TIM_BDTR_LOCK                            TIM_BDTR_LOCK_Msk
#define  TIM_BDTR_LOCK_0                          (0x1U << TIM_BDTR_LOCK_Pos) 
#define  TIM_BDTR_LOCK_1                          (0x2U << TIM_BDTR_LOCK_Pos) 
#define  TIM_BDTR_OSSI_Pos                        (10)
#define  TIM_BDTR_OSSI_Msk                        (0x1U << TIM_BDTR_OSSI_Pos)                       /*!<Off state selection in the idle mode*/
#define  TIM_BDTR_OSSI                            TIM_BDTR_OSSI_Msk
#define  TIM_BDTR_OSSR_Pos                        (11)
#define  TIM_BDTR_OSSR_Msk                        (0x1U << TIM_BDTR_OSSR_Pos)                       /*!<Off state selection in the run mode*/
#define  TIM_BDTR_OSSR                            TIM_BDTR_OSSR_Msk
#define  TIM_BDTR_BKE_Pos                         (12)
#define  TIM_BDTR_BKE_Msk                         (0x1U << TIM_BDTR_BKE_Pos)                        /*!<Break function enable*/
#define  TIM_BDTR_BKE                             TIM_BDTR_BKE_Msk
#define  TIM_BDTR_BKP_Pos                         (13)
#define  TIM_BDTR_BKP_Msk                         (0x1U << TIM_BDTR_BKP_Pos)                        /*!<Break input polarity*/
#define  TIM_BDTR_BKP                             TIM_BDTR_BKP_Msk
#define  TIM_BDTR_AOE_Pos                         (14)
#define  TIM_BDTR_AOE_Msk                         (0x1U << TIM_BDTR_AOE_Pos)                        /*!<Auto output enable*/
#define  TIM_BDTR_AOE                             TIM_BDTR_AOE_Msk
#define  TIM_BDTR_MOE_Pos                         (15)
#define  TIM_BDTR_MOE_Msk                         (0x1U << TIM_BDTR_MOE_Pos)                        /*!<Main output enable*/
#define  TIM_BDTR_MOE                             TIM_BDTR_MOE_Msk
#define  TIM_BDTR_DOE_Pos                         (16)
#define  TIM_BDTR_DOE_Msk                         (0x1U << TIM_BDTR_DOE_Pos)                        /*!<Direct output enable*/
#define  TIM_BDTR_DOE                             TIM_BDTR_DOE_Msk

/**
  * @brief TIM_OR Register Bit Definition
  */
#define  TIM_OR_ETR_RMP_Pos                       (0)
#define  TIM_OR_ETR_RMP_Msk                       (0x3U << TIM_OR_ETR_RMP_Pos)                      /*!<ETR multiplex*/
#define  TIM_OR_ETR_RMP                           TIM_OR_ETR_RMP_Msk
#define  TIM_OR_ETR_RMP_0                         (0x1U << TIM_OR_ETR_RMP_Pos) 
#define  TIM_OR_ETR_RMP_1                         (0x2U << TIM_OR_ETR_RMP_Pos) 

/**
  * @brief TIM_CCMR3 Register Bit Definition
  */
#define  TIM_CCMR3_OC5PE_Pos                      (3)
#define  TIM_CCMR3_OC5PE_Msk                      (0x1U << TIM_CCMR3_OC5PE_Pos)                     /*!<Output compare 5 preload enable*/
#define  TIM_CCMR3_OC5PE                          TIM_CCMR3_OC5PE_Msk

/**
  * @brief TIM_CCR5 Register Bit Definition
  */
#define  TIM_CCR5_CCR5_Pos                        (0)
#define  TIM_CCR5_CCR5_Msk                        (0xFFFFU << TIM_CCR5_CCR5_Pos)                    /*!<Compare 5 value*/
#define  TIM_CCR5_CCR5                            TIM_CCR5_CCR5_Msk
#define  TIM_CCR5_CCR5_0                          (0x0001U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_1                          (0x0002U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_2                          (0x0004U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_3                          (0x0008U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_4                          (0x0010U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_5                          (0x0020U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_6                          (0x0040U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_7                          (0x0080U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_8                          (0x0100U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_9                          (0x0200U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_10                         (0x0400U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_11                         (0x0800U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_12                         (0x1000U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_13                         (0x2000U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_14                         (0x4000U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_15                         (0x8000U << TIM_CCR5_CCR5_Pos) 

/**
  * @brief TIM_PDER Register Bit Definition
  */
#define  TIM_PDER_CCR1_SHIFT_EN_Pos               (1)
#define  TIM_PDER_CCR1_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR1_SHIFT_EN_Pos)              /*!<Enable channel 1 output PWM phase shift bit*/
#define  TIM_PDER_CCR1_SHIFT_EN                   TIM_PDER_CCR1_SHIFT_EN_Msk
#define  TIM_PDER_CCR2_SHIFT_EN_Pos               (2)
#define  TIM_PDER_CCR2_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR2_SHIFT_EN_Pos)              /*!<Enable channel 2 output PWM phase shift bit*/
#define  TIM_PDER_CCR2_SHIFT_EN                   TIM_PDER_CCR2_SHIFT_EN_Msk
#define  TIM_PDER_CCR3_SHIFT_EN_Pos               (3)
#define  TIM_PDER_CCR3_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR3_SHIFT_EN_Pos)              /*!<Enable channel 3 output PWM phase shift bit*/
#define  TIM_PDER_CCR3_SHIFT_EN                   TIM_PDER_CCR3_SHIFT_EN_Msk
#define  TIM_PDER_CCR4_SHIFT_EN_Pos               (4)
#define  TIM_PDER_CCR4_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR4_SHIFT_EN_Pos)              /*!<Enable channel 4 output PWM phase shift bit*/
#define  TIM_PDER_CCR4_SHIFT_EN                   TIM_PDER_CCR4_SHIFT_EN_Msk
#define  TIM_PDER_CCR5_SHIFT_EN_Pos               (5)
#define  TIM_PDER_CCR5_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR5_SHIFT_EN_Pos)              /*!<Enable channel 5 output PWM phase shift bit*/
#define  TIM_PDER_CCR5_SHIFT_EN                   TIM_PDER_CCR5_SHIFT_EN_Msk

