SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32G0020/MM32G0020_Bootloader/Device/MM32G0020/Include/reg_tim.h
/**
  * @brief TIM_CCRFALL Register Bit Definition
  */
#define  TIM_CCR1FALL_CCR1FALL_Pos                (0)
#define  TIM_CCR1FALL_CCR1FALL_Msk                (0xFFFFU << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL                    TIM_CCR1FALL_CCR1FALL_Msk                         /*!<Channel x compare value during count down in PWM central alignment mode.*/
#define  TIM_CCR1FALL_CCR1FALL_0                  (0x0001U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_1                  (0x0002U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_2                  (0x0004U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_3                  (0x0008U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_4                  (0x0010U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_5                  (0x0020U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_6                  (0x0040U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_7                  (0x0080U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_8                  (0x0100U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_9                  (0x0200U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_10                 (0x0400U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_11                 (0x0800U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_12                 (0x1000U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_13                 (0x2000U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_14                 (0x4000U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_15                 (0x8000U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Pos                (0)
#define  TIM_CCR2FALL_CCR2FALL_Msk                (0xFFFFU << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL                    TIM_CCR2FALL_CCR2FALL_Msk                         /*!<Channel x compare value during count down in PWM central alignment mode.*/
#define  TIM_CCR2FALL_CCR2FALL_0                  (0x0001U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_1                  (0x0002U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_2                  (0x0004U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_3                  (0x0008U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_4                  (0x0010U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_5                  (0x0020U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_6                  (0x0040U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_7                  (0x0080U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_8                  (0x0100U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_9                  (0x0200U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_10                 (0x0400U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_11                 (0x0800U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_12                 (0x1000U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_13                 (0x2000U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_14                 (0x4000U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_15                 (0x8000U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Pos                (0)
#define  TIM_CCR3FALL_CCR3FALL_Msk                (0xFFFFU << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL                    TIM_CCR3FALL_CCR3FALL_Msk                         /*!<Channel x compare value during count down in PWM central alignment mode.*/
#define  TIM_CCR3FALL_CCR3FALL_0                  (0x0001U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_1                  (0x0002U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_2                  (0x0004U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_3                  (0x0008U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_4                  (0x0010U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_5                  (0x0020U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_6                  (0x0040U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_7                  (0x0080U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_8                  (0x0100U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_9                  (0x0200U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_10                 (0x0400U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_11                 (0x0800U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_12                 (0x1000U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_13                 (0x2000U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_14                 (0x4000U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_15                 (0x8000U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Pos                (0)
#define  TIM_CCR4FALL_CCR4FALL_Msk                (0xFFFFU << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL                    TIM_CCR4FALL_CCR4FALL_Msk                         /*!<Channel x compare value during count down in PWM central alignment mode.*/
#define  TIM_CCR4FALL_CCR4FALL_0                  (0x0001U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_1                  (0x0002U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_2                  (0x0004U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_3                  (0x0008U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_4                  (0x0010U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_5                  (0x0020U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_6                  (0x0040U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_7                  (0x0080U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_8                  (0x0100U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_9                  (0x0200U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_10                 (0x0400U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_11                 (0x0800U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_12                 (0x1000U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_13                 (0x2000U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_14                 (0x4000U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_15                 (0x8000U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Pos                (0)
#define  TIM_CCR5FALL_CCR5FALL_Msk                (0xFFFFU << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL                    TIM_CCR5FALL_CCR5FALL_Msk                         /*!<Channel x compare value during count down in PWM central alignment mode.*/
#define  TIM_CCR5FALL_CCR5FALL_0                  (0x0001U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_1                  (0x0002U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_2                  (0x0004U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_3                  (0x0008U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_4                  (0x0010U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_5                  (0x0020U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_6                  (0x0040U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_7                  (0x0080U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_8                  (0x0100U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_9                  (0x0200U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_10                 (0x0400U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_11                 (0x0800U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_12                 (0x1000U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_13                 (0x2000U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_14                 (0x4000U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_15                 (0x8000U << TIM_CCR5FALL_CCR5FALL_Pos) 

/**
  * @brief TIM_TIM1_BKINF Register Bit Definition
  */
#define  TIM_BKINF_BKINFE_Pos                     (0)
#define  TIM_BKINF_BKINFE_Msk                     (0x1U << TIM_BKINF_BKINFE_Pos)               /*!<Break input filter enable*/
#define  TIM_BKINF_BKINFE                         TIM_BKINF_BKINFE_Msk
#define  TIM_BKINF_BKINF_Pos                      (1)
#define  TIM_BKINF_BKINF_Msk                      (0xFU << TIM_BKINF_BKINF_Pos)                /*!<Break input filter*/
#define  TIM_BKINF_BKINF                          TIM_BKINF_BKINF_Msk
#define  TIM_BKINF_BKINF_0                        (0x1U << TIM_BKINF_BKINF_Pos) 
#define  TIM_BKINF_BKINF_1                        (0x2U << TIM_BKINF_BKINF_Pos) 
#define  TIM_BKINF_BKINF_2                        (0x4U << TIM_BKINF_BKINF_Pos) 
#define  TIM_BKINF_BKINF_3                        (0x8U << TIM_BKINF_BKINF_Pos) 
#define  TIM_BKINF_BKIN_SEL_Pos                   (5)
#define  TIM_BKINF_BKIN_SEL_Msk                   (0xFFFU << TIM_BKINF_BKIN_SEL_Pos)           /*!<Break input channel selects*/
#define  TIM_BKINF_BKIN_SEL                       TIM_BKINF_BKIN_SEL_Msk
#define  TIM_BKINF_BKIN_SEL_0                     (0x001U << TIM_BKINF_BKIN_SEL_Pos) 
#define  TIM_BKINF_BKIN_SEL_1                     (0x002U << TIM_BKINF_BKIN_SEL_Pos) 
#define  TIM_BKINF_BKIN_SEL_2                     (0x004U << TIM_BKINF_BKIN_SEL_Pos) 
#define  TIM_BKINF_BKIN_SEL_3                     (0x008U << TIM_BKINF_BKIN_SEL_Pos) 
#define  TIM_BKINF_BKIN_SEL_4                     (0x010U << TIM_BKINF_BKIN_SEL_Pos) 
#define  TIM_BKINF_BKIN_SEL_5                     (0x020U << TIM_BKINF_BKIN_SEL_Pos) 
#define  TIM_BKINF_BKIN_SEL_6                     (0x040U << TIM_BKINF_BKIN_SEL_Pos) 
#define  TIM_BKINF_BKIN_SEL_7                     (0x080U << TIM_BKINF_BKIN_SEL_Pos) 
#define  TIM_BKINF_BKIN_SEL_8                     (0x100U << TIM_BKINF_BKIN_SEL_Pos) 
#define  TIM_BKINF_BKIN_SEL_9                     (0x200U << TIM_BKINF_BKIN_SEL_Pos) 
#define  TIM_BKINF_BKIN_SEL_10                    (0x400U << TIM_BKINF_BKIN_SEL_Pos) 
#define  TIM_BKINF_BKIN_SEL_11                    (0x800U << TIM_BKINF_BKIN_SEL_Pos) 

/** ------------------------------------------------------------------------------------------------------------------*/
#endif
/** ------------------------------------------------------------------------------------------------------------------*/
